{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3d8724d9-1df6-4a54-9356-186b36206c64')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3d8724d9-1df6-4a54-9356-186b36206c64')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "Honeypot account sign-in activity detected",
                "description": "Detects any sign‑in attempt (successful or failed) to a designated honeypot account.\nAny authentication activity against this account is considered suspicious, as the account is not expected to be used for legitimate sign‑ins.",
                "severity": "High",
                "enabled": true,
                "query": "SigninLogs\r\n| where UserPrincipalName == \"backup.admin@example.com\"\r\n| extend\r\n    SignInStatus = iff(ResultType == 0, \"Successful sign-in\", \"Failed sign-in\")\r\n| project\r\n    TimeGenerated,\r\n    UserPrincipalName,\r\n    SignInStatus,\r\n    ResultType,\r\n    ResultDescription,\r\n    IPAddress,\r\n    AppDisplayName,\r\n    ClientAppUsed,\r\n    ConditionalAccessStatus,\r\n    Location",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "CredentialAccess",
                    "InitialAccess"
                ],
                "techniques": [
                    "T1110",
                    "T1078"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "Honeypot account sign-in activity detected: {{UserPrincipalName",
                    "alertDescriptionFormat": "A sign-in attempt was detected against the honeypot account {{UserPrincipalName}}.\n\nSign-in status: {{SignInStatus}}\nSource IP address: {{IPAddress}}\n\nThis account is a honeypot account and should not be used for legitimate authentication activity",
                    "alertDynamicProperties": []
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "UserPrincipalName"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IPAddress"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
